{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Доброе утро",
        "Добрый день",
        "добрый вечер",
        "доброй ночи",
        "приветствую",
        "привет",
        "здравствуйте",
        "доброго времени суток",
        "приветствую вас",
        "хай",
        "хеллоу",
        "здорова",
        "приветульки",
        "приветики",
        "хаю хай"
      ],
      "responses": [
        "Доброго времени суток",
        "Здравствуйте",
        "Приветствую"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Пока",
        "Всего доброго",
        "Досвидания",
        "До свидания",
        "Прощайте",
        "Прощай",
        "Ладно,пока",
        "ок",
        "оки",
        "окей",
        "окейси",
        "спс",
        "ок,спс",
        "ну ладно",
        "хорошо,спасибо",
        "ладно,давай,пока",
        "ясно"],
      "responses": [
        "Всего доброго",
        "Обращайтесь"
      ]
    },
    {
      "tag": "question_about_profile",
      "patterns": [
        "я не нарушал никаких правил",
        "вы можете проверить мой профиль? я не нарушал правила.",
        "я не нарушал ваши правила",
        "я не нарушал правила вашего сайта. как я могу восстановить свой доступ",
        "как мне продолжить решение задач",
        "но я не нарушал правила сайта",
        "как я могу восстановить свой профиль",
        "профиль",
        "я не вижу свой рейтинг, я не нарушал правила сайта. что случилось",
        "я могу восстановить страницу для прохождения и решения задач?",
        "как мне восстановить профиль?",
        "помогите восстановить мой профиль, пожалуйста?",
        "что-то не так с моим профилем",
        "правила я не нарушал, честное слово",
        "правила нарушены не были, в чем дело может быть?"


      ],
      "responses": [
        "Все-таки вы нарушили правила сайта, хотя ясно сказано, что любое нарушение ведет к блокировке профиля. \n Доступ к рейтинговым задачам откроется только через год!\n Учебные задачи вам по-прежнему остаются доступны, но рейтинг для вас пока закрыт, соответственно сертификат вы получить не можете.\n Исключений не делаем.",
        "Читайте внимательно правила сайта! Любое их нарушение ведет к блокировке профиля и потери рейтинга.\n Восстановить доступ к рейтинговым задачам возможно только через год! \nА пока готовьтесь и решайте учебные задачи.\n Исключений не делаем.",
        "В правилах сайтах ясно сказано, что их нарушение ведет к блокировке профиля.\n Читайте внимательнее, пожалуйста и учитесь не брать чужие решения, а выполнять задачи самостоятельно! \nДоступ к рейтингу и возможность получить сертификат откроются вам только через год.\n Исключений не делаем."
      ]
    },
    {
      "tag": "question_about_ban",
      "patterns": [
        "добрый день. у меня вопрос по поводу бана",
        "добрый день. я почему-то не вижу свой рейтинг",
        "я почему-то не вижу свой рейтинг",
        "Добрый день. Подскаж ите пожалуйста, почему мне недоступен рейтинг и я не могу решить задачи?",
        "что-то не так, я не нарушал правила сайта, однако не вижу свой рейтинг. подскажите, что случилось?",
        "почему мой профиль заблокирован?",
        "вы можете мне подсказать по поводу бана? я не вижу свой рейтинг почему-то",
        "бан",
        "почему меня забанили",
        "почему забанили",
        "раньше показывало какие упражнения пройдены, сейчас нет",
        "почему меня забанили? Это временно или навсегда? Как можно получить разбан?",
        "почему меня забанили?",
        "раньше показывало какие упражнения пройдены, сейчас нет",
        "почему меня забанили? Это временно или навсегда? Как можно получить разбан?",
        "Задания только начала выполнять, пользовалась инструкциями на сайте.Видимо, произошла какая-то ошибка, у меня бан.",
        "Помогите со следующей проблемой, почему-то у меня на персональной странице не отображается статистика решенных задач (ранее она была, но потом пропала).",
        "у меня такая проблема, что не вижу своего профиля? Перехожу на персональную страницу, или профиль, и просто пустое место вместо данных!",
        "Сбросился прогресс выполнения задач, не открывается страница профиля, не сохраняются новые решенные или просто открытые задачи. В чем проблема?",
        "Почему и за что? Я ни на каких форумах вопросы по задачам не размещала.",
        "я не могу найти флажок, который убирает автозаполнение уже решенных задач. И еще раньше у вас были галочки в списке задач, теперь не понятно какую решил, а какие остались задачи, могли бы их вернуть, пожалуйста?",
        "во во время решения задачи возникла такая ситуация: Ограничение доступа связано с нарушением правил сайта. В том случае, если вы не нарушали правил, обратитесь к s.moiseenko@sql-ex.ru.Неверно. Я никакие правила сайта не нарушала и пыталась написать на указанную почту, но адрес не распознан. Что мне делать?",
        "Пропала Персональная страница , меня нет в рейтинге SELECT (обучающий этап). Технические работы?",
        "Как зайти на ваш форум и посмотреть решение уже решенной мной задачи? Пропали все значки Ok с прежних задач которые я решил. По моему с моим профилем что-то не так...",
        "Во время решения задач DML меня забанили. Правила сервиса я не нарушал. Прошу снять бан для продолжения работы.",
        "Не могу войти на форум. Можно узнать причину бана, если я буквально ничего не сделал?",
        "у меня перестали отмечаться правильно выполненные задачи в обучающем этапе (Раньше напротив задачи была надпись Ок). Также не отображается позиция в рейтинге, и не появляется ссылка на обсуждение на форуме",
        "у меня возникла проблема, мой профиль не открывается и задачи не засчитываются, что нужно сделать чтоб исправить это?",
        "Я только зарегистрировался на сайте, а мне сразу ограничили доступ. Хотелось бы узнать, с чем это связано",
        "почему ретинг у меня не показывает ? все задачи которые решил пропали (все задачи где были  ок)",
        "ПОдскажите, почему у меня пропали ОК у решенных задач и рейтинг? Сейчас список всех задач в обучающих упражнениях подсвечивается зеленым и без ОК,. У меня было решено 65 задач.",
        "Обращаюсь по поводу блокировки моего аккаунта. Voropaev V.D. (IU3_VV). Не могли бы Вы, пожалуйста, разблокировать его? Не понимаю, почему так вообще произошло.",
        "у меня проблема с рейтингом. Во -первых , нет рейтинга.Во-вторых, пропало значение ОК на решенных задачах. Помогите с этим, пожалуйста.Мне нужно решить это до сб, у меня будет занятие в ВУЗе. ",
        "получил от вас BAN. Думаю, что вполне заслуженно, в связи с тем, что ряд задач, до которых я ещё не дорос, подсматривал в Интернете. Но только лишь для того, чтобы разобраться в данной теме и пошагово разобрать решение, детально изучив, решения на форуме. Если возможно, то прошу вас разблокировать меня, ведь я не пытаюсь набрать какие-то там баллы, а стремлюсь только лишь к изучению SQL, который для меня пока как тёмный лес.Спасибо за понимание.",
        "Почему мне выдаёт ошибку что я нарушил правила сайта, если я этого не делал",
        "Произошла такая проблема, что я не вижу себя в списках рейтинга, когда решаю задачи обучающего этапа. Позже увидел, что все то, что я решал, аннулировано и, как я понимаю, учетную запись заблокировали. Как я понимаю, заблокировали меня из-за копипасты, но я пишу всё сам в блокноте, чтобы сохранить решение, после вставляю решение в ваш ресурс. Затем я создал новый аккаунт, но уже начал писать решение исключительно на вашем ресурсе, и опять по новой получил блокировку. Можете прояснить ситуацию пожалуйста и принять меры?",
        "Не отображаются баллы в Упражнения по SQL SELECT (обучающий этап). В чем может быть проблема? Браузер Google Chrome 85, блокировщик рекламы выключен.",
        "столкнулся с тем, что получил бан, можно ли узнать причину бана?"],
      "responses": [
        "Вы могли попасть в теневой список в том случае, если вы нарушили правила сайта. \n Пожалуйста, ознакомьтесь с ними https://www.sql-ex.ru/site_rules.php.",
        "Вы могли попасть в теневой список(бан), если были нарушены правила сайта https://www.sql-ex.ru/site_rules.php.",
        "Если вы не видите свой рейтинг, не отображаются задания, статистика решенных задач, не открывается страница профиля, не сохраняются новые решения, значит вы попали в теневой список(бан).\n Это могло возникнуть вследствие нарушения правил сайта https://www.sql-ex.ru/site_rules.php.",
        "Вы, вероятно нарушили правила сайта https://www.sql-ex.ru/site_rules.php, поэтому полноценный доступ к задачам мы вынуждены были приостановить.",
        "Если вы нарушаете правила сайта, то автоматически попадаете в теневой список(бан). \nПожалуйста, внимательно читайте правила сайта https://www.sql-ex.ru/site_rules.php.",
        "Если вы столкнулись с такой ситуацией, то, вероятнее всего, вы нарушили правила нашего сайта https://www.sql-ex.ru/site_rules.php.",
        "Мы фиксируем любые нарушения правил https://www.sql-ex.ru/site_rules.php. \nПоэтому, если вы столкнулись с такой ситуацией, то это только ваша вина.",
        "Читайте внимательно правила https://www.sql-ex.ru/site_rules.php, пожалуйста и не будете попадать в подобные ситуации",
        "Внимательно читайте правила https://www.sql-ex.ru/site_rules.php! \nНарушаете их-попадаете в теневой список(бан)",
        "Если у вас появились такие проблемы, значит вы нарушили политику нашего сайта.\n Прежде чем выполнять задания, всегда читайте правила, дабы не попасть в бан https://www.sql-ex.ru/site_rules.php. \nКопирование чужих решений, повторная регистрация и тд влечет за собой попадание в черный список нашего сайта! \nВыполняйте задания честно!"]
    },
    {
      "tag": "question_about_registration",
      "patterns": [
        "Здравствуйте! Прошел процесс регистрации, не пришло письмо на эл почту.При вводе данных логин/пароль на сайте появляется сообщение Данные о пользователе введены неправильно!\"Просьба помочь, спасибо"
      ],
      "responses": [
        "Если регистрация прошла успешно (поздравление на странице), воспользуйтесь напоминанием пароля.При этом вы должны быть автоматически авторизованы.Вероятно, при регистрации были ошибки (пишутся вверху слева красным цветом)."
      ]
    },
    {
      "tag": "question_about_certificate",
      "patterns": [
        "ладно..а как мне теперь получить сертификат? очень нужен для вуза",
        "Как мне получить сертификат?",
        "У меня следующий вопрос: как я могу получить сертификат? Сколько заданий мне нужно выполнить?",
        "вопрос по поводу сертификации",
        "как мне пройти сертификацию, как получить сертификат?",
        "сколько задач необходимо решить, чтобы получить сертификат и пройти сертификацию",
        "сертификация",
        "дайте мне сертификат",
        "для чего нужен сертификат. как мне его получить",
        "подскажите пожалуйста, какие образом я могу получить сертификат?",
        "как получить сертификат",
        "мне бы хотелось получить сертификат и пройти сертификацию. как я могу это сделать?",
        "Добрый день! Для получения сертификата Basic Knowledge необходимо решить 63 рейтинговых задачи SELECT.Когда я захожу в раздел с задачами \"SELECT (рейтинговые этапы)\", то мне доступны только 23 задачи. ",
        "Здравствуйте! Хочу заказать сертификат basic knowledge. Если нажимаю \"оформить заявку\", мне пишут, что \"К сожалению, Вы еще не решили как минимум 63 упражнений SELECT(1)...\", хотя я решил 80",
        "Хочу получить сертификат",
        "каким образом я могу получить сертификат",
        "мне необходимо получить сертификат, как я могу это сделать",
        "сертификат",
        "сертификация",
        "я не понимаю, как я могу получить сертификат. сколько задач надо решить",
        "как я смогу получить у вас сертификат? очень нужен для вуза",
        "хочу сертификат",
        "подарите мне сертификат",
        "как я смогу получить у вас сертификат?",
        "а сколько мне нужно решать задач для получения сертификата?"
      ],
      "responses": [
        "Если вы хотите получить сертификат, вам нужно решить 63 рейтинговые задача на языке SQL. \nПросьба не путать рейтинговые задачи от задач обучающего этапа. \nЗадачи будут появляться по одной по мере их решения",
        "Получить сертификат вы можете путем решения всех рейтинговых задач. \nПросьба не путать рейтинговые задачи от задач обучающего этапа.\n Задачи будут появляться по одной по мере их решения",
        "Чтобы получить сертификат, вам необходимо решить рейтинговые задания.\n Задачи будут появляться по мере их решения каждой из них.",
        "Сертификат можно получить, решив 63 рейтинговых задач. \nПоявляться они будут по одной, по мере решения.",
        "Для того, чтобы получить сертификат, вам необходимо решить 63 рейтинговые задачи. \nПросьба не путать рейтинговые задачи от задач обучающего этапа. \nЗадачи будут появляться по одной по мере их решения"
      ]
    },
    {
      "tag": "question_about_mood",
      "patterns": [
        "как дела",
        "как самочувствие",
        "как делишки",
        "как вы себя чувствуете",
        "у вас все хорошо?",
        "как настроение",
        "как у вас дела",
        "как ты?",
        "все хорошо?",
        "все нормально у тебя?",
        "как вы поживаете",
        "как поживаешь",
        "как ты там поживаешь?"
      ],
      "responses": [
        "Дела обстоят отлично, но будет еще лучше, если вы будете заниматься и не нарушать правила сайта :)"
      ]
    },
    {
      "tag": "question_about_weather",
      "patterns": [
        "какая завтра погода",
        "можешь подсказать какая будет погода",
        "хорошая погода будет",
        "ты знаешь что такое погода",
        "тебе нравится такая погода?",
        "любишь такую погоду?",
        "давай поговорим о погоде?",
        "прогноз погоды можешь для меня узнать, пожалуйста?"
      ],
      "responses": [
        "На этот счет я не могу вам ответить. \nВсе посторонние вопросы, не касающиеся сайта, ко мне не относятся.",
        "Я бы и рад ответить на ваш вопрос, но не имею к этому никакого отношения"
      ]
    },
    {
      "tag": "question_about_name",
      "patterns": [
        "у тебя есть имя?",
        "как твое имя?",
        "как тебя зовут?",
        "как к тебе обращаться?",
        "как я могу к тебе обращаться?",
        "как я могу к вам обращаться?"
      ],
      "responses": [
         "Вы можете меня называть Бот"
      ]
    },
    {
      "tag": "question_about_slang",
      "patterns": [
        "круто",
        "кайф",
        "балдеж",
        "оки доки",
        "вы мне очень помогли, спасибо"
      ],
      "responses": [
         ":)"
      ]
    },
    {
      "tag": "question_about_question",
      "patterns": [
        "можно еще вопрос задать?",
        "а можно еще задать вопрос?"
      ],
      "responses": [
         "спрашивайте"
      ]
    },
    {
      "tag": "question_about_task",
      "patterns": [
        "чем отличается рейтинговая задача от учебной?",
        "что такое рейтинговая задача?",
        "что такое учебная задача?"
      ],
      "responses": [
         "Рейтинговые задачи отличаются от учебных тем, что вы можете получить сертификат для своего портфолио после их успешного прохождения"
      ]
    },
    {
      "tag": "question_about_brain",
      "patterns": [
        "я по вашему умный?"
      ],
      "responses": [
         "Трудный вопрос...пожалуй, я воздержусь от ответа."
      ]
    },
    {
      "tag": "question_about_study",
      "patterns": [
        "можно еще вопрос задать?"
      ],
      "responses": [
         "спрашивайте"
      ]
    },
    {
      "tag": "question_about_many_task",
      "patterns": [
        "а чего так много?",
        "ого",
        "многовато",
        "много че-то",
        "слишком много",
        "слишком много задач",
        "это слишком сложно для меня",
        "почему так много",
        "многовато, вам так не кажется?"
      ],
      "responses": [
         "🤷‍"
      ]
    },
        {
      "tag": "question_about_etc",
      "patterns": [
        "где купить молока",
        "где купить",
        "хочу кушать",
        "купи покушать",
        "ты хочешь кушать?",
        "кефир"
      ],
      "responses": [
         "🙁"
      ]
    }
  ]
}
